.config/doom/modules/lang/org-patch/config.org
#+TITLE: Config
#+property: header-args:emacs-lisp :tangle yes
#+property: header-args:elisp :tangle yes

* Packages
#+begin_src elisp :tangle packages.el
(package! deft)
(package! noflet)
(package! ob-mermaid)
(package! org-anki)
(package! org-gtd)
(package! org-ref)
(package! org-pomodoro)
(package! doct)
(package! org-super-agenda :pin "fb5e2ef277bc811a3b061106c99e4c47b6b86f80")
(package! org-pretty-table
  :recipe (:host github :repo "Fuco1/org-pretty-table") :pin "87772a9469d91770f87bfa788580fca69b9e697a")


(package! org-modern)
(package! org-ql)
(package! origami)
(package! ox-pandoc)
(package! poly-org)
#+end_src

* GTD
** Keybindings
Global keybindings:
| Keybinding | Description                       |
|------------+-----------------------------------|
| c          | Capture (to inbox file)           |
| e          | Engage (go to GTD agenda)         |
| p          | Process inbox                     |
| P          | Open planning agenda              |
| d          | Open daily agenda                 |
| a          | Open an agenda for an action list |
| n          | Show all NEXT tasks               |
| s          | Show projects that are stuck      |
| A          | Archive completed tasks           |
Keybindings while processing a task:
| Keybinding | Description   |
|------------+---------------|
| C-c C-c    | Finalize task |
#+begin_src elisp :noweb no-export
(use-package! org-gtd
  :after (org org-ql)
  ;; TODO this isn't being set properly using :custom, need to debug why when I have a chance
  ;;:custom
  ;;(+patch/org-gtd-tasks-file (concat (file-name-as-directory org-gtd-directory) "org-gtd-tasks.org"))
  :init
  <<org-gtd-directory>>
  <<org-gtd-recommendations>>
  <<org-gtd-edna>>
  <<agenda-incubate-and-hatch>>
  (map! (:leader (:prefix-map ("G" . "GTD")
                  :desc "Capture"             "c" #'org-gtd-capture
                  :desc "Engage"              "e" #'org-gtd-engage
                  :desc "Process Inbox"       "p" #'org-gtd-process-inbox
                  :desc "Plan"                "P" (lambda () (interactive) (org-ql-view "Planning"))
                  :desc "Daily Agenda"        "d" (lambda () (interactive) (org-ql-view "Daily"))
                  :desc "Action List"         "a" #'org-ql-action-list
                  :desc "Show all next"       "n" #'org-gtd-show-all-next
                  :desc "Show stuck projects" "s" #'org-gtd-show-stuck-projects
                  :desc "Capture"             "c" #'org-gtd-capture
                  :desc "Archive Done"        "A" #'org-gtd-archive-completed-items))
        (:map org-gtd-process-map       "C-c C-c" #'org-gtd-choose)))
#+end_src
** GTD Files
Store GTD files in XDG-based path, sync-ed by Syncthing
#+name: org-gtd-directory
#+begin_src elisp :tangle no
(setq org-gtd-directory "~/.local/share/notes/gtd/")
#+end_src
** Other Recommended config
These are suggested by the `org-gtd` README: set tags when processing tasks, add a `DELEGATED_TO` property, and add an agenda keybinding to the agenda
#+name: org-gtd-recommendations
#+begin_src elisp :tangle no
(setq org-gtd-process-item-hooks '(org-set-tags-command))
#+end_src
** `org-edna` config for GTD
Right now this is only the recommendations from `org-gtd`, but I'll probably add more eventually.
#+name: org-gtd-edna
#+begin_src elisp :tangle no
(setq org-edna-use-inheritance t)
(org-edna-mode 1)
#+end_src
* Roam
#+begin_src elisp :noweb no-export
(use-package! org-roam
  :after doct
  :custom
  <<org-roam-directory>>
  <<org-roam-completion-everywhere>>
  :config
  <<doct-org-roam>>
  <<org-roam-capture-templates>>
  ;; start org-roam on startup
  (org-roam-db-autosync-mode))
#+end_src
** Roam Files
Store `org-roam` files in XDG-based path, sync-ed by Syncthing
#+name: org-roam-directory
#+begin_src elisp :tangle no
(org-roam-directory "~/.local/share/notes/zettelkasten/")
#+end_src
** Roam completion everywhere
On the fence about this one, need to check on the performance. Makes linking roam notes together simple though, so I'm enabling it for now: it just provides tab completion for roam note titles.
#+name: org-roam-completion-everywhere
#+begin_src elisp :tangle no
(org-roam-completion-everywhere t)
#+end_src
