.config/doom/modules/lang/org-patch/config.org
** Todo keywords [0/1]
- [ ] TODO: do I need both `CANCELLED` and `TRASH`?
The sequence of stages my tasks go through. See the [[https://orgmode.org/manual/Tracking-TODO-state-changes.html][org manual]] for more info, but `!` gives a timestamp, `@` lets you leave a note when transitioning through that state, and `/` denotes whether the other symbols happen when transitioning in vs out of the state (before `/` is for transitioning into the state, which is the default).
- TODO: on the agenda, but not something to immediately work on
- NEXT: the next tag in a project (in the GTD sense)
- WAIT: blocked by something, don't even consider it a todo until it's unblocked
- DONE: finished, congrats
- CANCELLED: decided not to do this while working on it
- TRASH: decided not to do this while prioritizing

#+name: todo-keywords
#+begin_src elisp :tangle no
(setq org-todo-keywords
      '((sequence "NEXT(n)" "TODO(t!)" "WAIT(w@/!)" "|" "DONE(d!)" "CANCELED(c@!)" "TRASH(r!)")))
(setq org-todo-keyword-faces
      '(("NEXT" . (:foreground "#f0dfaf" :weight bold))
        ("WAIT" . (:foreground "#dc8cc3" :weight bold))
        ("CANCELED" . (:foreground "#8cd0d3" :weight bold))
        ("TRASH" . (:foreground "#dfaf8f" :weight bold))))
#+end_src
* Capture
** Capture Templates [0/1]
`doct` makes writing capture templates much simpler and more readable
#+begin_src elisp :noweb no-export
(use-package! doct
  :after (org org-capture)
  :commands doct
  :custom
  <<org-capture-templates>>)
  
#+end_src
Nice function for passing properties to `doct`
#+begin_src elisp :tangle no
(defun my/doct-properties ()
                   "Add declaration's :properties to current entry."
                   (let ((properties (doct-get :properties)))
                     (dolist (keyword (seq-filter #'keywordp properties))
                       (org-set-property (substring (symbol-name keyword) 1)
                                         (plist-get properties keyword)))))
;; Usage:
;; (doct '(("My capture template"
;;          ...
;;          :hook my/org-property-drawer
;;          :properties (:anki_deck "${category}"))))
#+end_src
See the [[https://orgmode.org/manual/Template-expansion.html][template expansion docs]] for more info on the syntax here
Appending to existing templates to keep project templates
- [ ] figure out where existing templates are coming from, and migrate useful ones here
#+name: org-capture-templates
#+begin_src elisp :tangle no
;; setq
(org-capture-templates
 (append org-capture-templates
         (doct '(("Inbox"
                  :keys "i"
                  :file "~/.local/share/notes/gtd/inbox.org"
                  :template "* %?"
                  :kill-buffer t)
                 ("Today"
                  :keys "2"
                  :file "~/.local/share/notes/gtd/org-gtd-tasks.org"
                  :olp ("Calendar")
                  :template ("* TODO %?"
                             "SCHEDULED: %(org-insert-time-stamp (org-read-date nil t \"+0d\"))")
                  :prepare-finalize (lambda () (progn (org-priority)
                                                      (org-set-tags-command)))
                  :kill-buffer t)
                 ("Meeting"
                  :keys "m"
                  :children
                  (("Retro"
                    :keys "r"
                    :file "~/.local/share/notes/meetings/retro.org"
                    :datetree t
                    :template "* %?"
                    :kill-buffer t)
                   ("Nico 1:1"
                    :keys "n"
                    :file "~/.local/share/notes/meetings/nico.org"
                    :datetree t
                    :template "* %?"
                    :kill-buffer t)
                   ("Haotian 1:1"
                    :keys "h"
                    :file "~/.local/share/notes/meetings/haotian.org"
                    :datetree t
                    :template "* %?"
                    :kill-buffer t)
                   ("Parking Lot"
                    :keys "p"
                    :file "~/.local/share/notes/meetings/parking-lot.org"
                    :datetree t
                    :template "* %?"
                    :kill-buffer t)
                   ("Kinso"
                    :keys "k"
                    :file "~/.local/share/notes/meetings/kinso.org"
                    :datetree t
                    :template "* %?"
                    :kill-buffer t)))
                 ("Shopping" :keys "s"
                  :file "~/.local/share/notes/reference/shopping.org"
                  :template "* %?"
                  :children
                  (("Home" :keys "h" :olp ("Home"))
                   ("Christmas" :keys "c" :olp ("Christmas"))
                   ("Gift" :keys "g" :olp ("Gifts")) ; TODO either add recipient as tag or in olp
                   ("Groceries" :keys "o" :olp ("Groceries"))))
                 (:group "Reference"
                  :file "~/.local/share/notes/reference/capture.org"
                  :template "* %?"
                  :children
                  (("Food"
                    :keys "f"
                    :children
                    (("Recipe"     :keys "r" :olp ("Recipes"))
                     ("Cocktail"   :keys "c" :olp ("Cocktails"))
                     ("Restaurant" :keys "s" :olp ("Restaurants"))))
                   ("Media" :keys "e"
                    :children
                    (("Movie"   :keys "m" :olp ("Movies"))
                     ("Show"    :keys "s" :olp ("Shows"))
                     ("Book"    :keys "b" :olp ("Books"))
                     ("Article" :keys "a" :olp ("Articles"))
                     ("Album"   :keys "l" :olp ("Albums"))))
                   ("Repo" :keys "r" :olp ("Repos"))))))))
#+end_src
** capture everywhere
When I'm doing things outside of emacs, it would be nice to still use the same capture interface. I used to use org protocol plus an alfred command, but I opted for something that utilizes org-mode's typical capture interface, by popping up a new emacs frame and capturing from there.
Heavily inspired by [[https://macowners.club/posts/org-capture-from-everywhere-macos/][this blog post]] (for the majority of the logic) and [[https://github.com/tecosaur/emacs-everywhere][emacs-everywhere]] (borrowed the logic for getting back to the app I was in before capturing).
Similar to my setup for emacs-everywhere, I have an algfred workflow that uses a keybinding to trigger a script running `/usr/local/bin/emacsclient --eval "(capture-everywhere)"`.
#+begin_src elisp
(after! emacs-everywhere
  (defun get-app-name ()
    "Get the name of the current app (useful for returning to that app later). Currently uses osascript, so only useful on macos."
    (let ((default-directory emacs-everywhere--dir))
      (with-temp-buffer
        (call-process "osascript" nil t nil "app-name")
        (string-trim (buffer-string)))))

  (defun capture-everywhere ()
    "Create a new frame and run `org-capture'."
    (interactive)
    (require 'noflet)
    (make-frame `((name . "capture")
                  (top . 300)
                  (left . 700)
                  (width . 80)
                  (height . 25)
                  (emacs-everywhere-prior-app . ,(get-app-name))))

    (select-frame-by-name "capture")
    (delete-other-windows)
    (noflet ((switch-to-buffer-other-window (buf) (switch-to-buffer buf)))
            (org-capture)))


  (defadvice org-capture-finalize
      (after delete-capture-frame activate)
    "Advise capture-finalize to close the frame and return to the app we came from"
    (when emacs-everywhere-window-focus-command
      (apply #'call-process (car emacs-everywhere-window-focus-command)
             nil nil nil
             (mapcar (lambda (arg)
                       (replace-regexp-in-string "%w" (frame-parameter nil 'emacs-everywhere-prior-app) arg))
                     (cdr emacs-everywhere-window-focus-command))))
    (delete-frame)))
#+end_src
* Agenda
#+begin_src emacs-lisp :noweb no-export
(use-package! org-agenda
  :commands org-agenda
  :custom
  <<agenda-files>>
  :config
  <<agenda-prefix>>
  <<sync-buffer-to-file>>
  <<sync-file-to-agenda>>
  <<agenda-reschedule>>)
#+end_src
** Agenda Files
Only track my task-related files in the agenda
#+name: agenda-files
#+begin_src elisp :tangle no
(org-agenda-files '("~/.local/share/notes/gtd/org-gtd-tasks.org"))
#+end_src
** Agenda format
Simplify the agenda prefix to only include what I need to see
#+name: agenda-prefix
#+begin_src emacs-lisp :tangle no
(setq org-agenda-prefix-format
      '((agenda . "  %?-12t")
        (todo   . " ")
        ;; should maybe come back to these next two, but haven't had a need for it yet
        (tags   . " %i %-12:c")
        (search . " %i %-12:c")))
#+end_src
** Sync
*** Save buffers when modifying todos (taken from [[https://emacs.stackexchange.com/a/33063/15634][this SO answer]])
#+name: sync-buffer-to-file
#+begin_src elisp :tangle no
(defmacro η (fnc)
  "Return function that ignores its arguments and invokes FNC."
  `(lambda (&rest _rest)
     (funcall ,fnc)))

(advice-add 'org-deadline       :after (η #'org-save-all-org-buffers))
(advice-add 'org-schedule       :after (η #'org-save-all-org-buffers))
(advice-add 'org-store-log-note :after (η #'org-save-all-org-buffers))
(advice-add 'org-todo           :after (η #'org-save-all-org-buffers))
(advice-add 'org-refile         :after (η #'org-save-all-org-buffers))
#+end_src
*** Update agenda after 5mins of idle time (inspired by [[https://emacs.stackexchange.com/a/47266/15634][this SO answer]]) [0/1]
- [ ] need to also sync file to buffer
#+name: sync-file-to-agenda
#+begin_src elisp :tangle no
(run-with-idle-timer 300 t (lambda () (save-window-excursion (org-agenda nil "."))))
#+end_src
