.config/doom/modules/lang/org-patch/config.el

(use-package! doct
  :after (org org-capture)
  :commands doct
  :custom
  ;; setq
  (org-capture-templates
   (append org-capture-templates
           (doct '(("Inbox"
                    :keys "i"
                    :file "~/.local/share/notes/gtd/inbox.org"
                    :template "* %?"
                    :kill-buffer t)
                   ("Today"
                    :keys "2"
                    :file "~/.local/share/notes/gtd/org-gtd-tasks.org"
                    :olp ("Calendar")
                    :template ("* TODO %?"
                               "SCHEDULED: %(org-insert-time-stamp (org-read-date nil t \"+0d\"))")
                    :prepare-finalize (lambda () (progn (org-priority)
                                                        (org-set-tags-command)))
                    :kill-buffer t)
                   ("Meeting"
                    :keys "m"
                    :children
                    (("Retro"
                      :keys "r"
                      :file "~/.local/share/notes/meetings/retro.org"
                      :datetree t
                      :template "* %?"
                      :kill-buffer t)
                     ("Nico 1:1"
                      :keys "n"
                      :file "~/.local/share/notes/meetings/nico.org"
                      :datetree t
                      :template "* %?"
                      :kill-buffer t)
                     ("Haotian 1:1"
                      :keys "h"
                      :file "~/.local/share/notes/meetings/haotian.org"
                      :datetree t
                      :template "* %?"
                      :kill-buffer t)
                     ("Parking Lot"
                      :keys "p"
                      :file "~/.local/share/notes/meetings/parking-lot.org"
                      :datetree t
                      :template "* %?"
                      :kill-buffer t)
                     ("Kinso"
                      :keys "k"
                      :file "~/.local/share/notes/meetings/kinso.org"
                      :datetree t
                      :template "* %?"
                      :kill-buffer t)))
                   ("Shopping" :keys "s"
                    :file "~/.local/share/notes/reference/shopping.org"
                    :template "* %?"
                    :children
                    (("Home" :keys "h" :olp ("Home"))
                     ("Christmas" :keys "c" :olp ("Christmas"))
                     ("Gift" :keys "g" :olp ("Gifts")) ; TODO either add recipient as tag or in olp
                     ("Groceries" :keys "o" :olp ("Groceries"))))
                   (:group "Reference"
                    :file "~/.local/share/notes/reference/capture.org"
                    :template "* %?"
                    :children
                    (("Food"
                      :keys "f"
                      :children
                      (("Recipe"     :keys "r" :olp ("Recipes"))
                       ("Cocktail"   :keys "c" :olp ("Cocktails"))
                       ("Restaurant" :keys "s" :olp ("Restaurants"))))
                     ("Media" :keys "e"
                      :children
                      (("Movie"   :keys "m" :olp ("Movies"))
                       ("Show"    :keys "s" :olp ("Shows"))
                       ("Book"    :keys "b" :olp ("Books"))
                       ("Article" :keys "a" :olp ("Articles"))
                       ("Album"   :keys "l" :olp ("Albums"))))
                     ("Repo" :keys "r" :olp ("Repos")))))))))

(after! emacs-everywhere
  (defun get-app-name ()
    "Get the name of the current app (useful for returning to that app later). Currently uses osascript, so only useful on macos."
    (let ((default-directory emacs-everywhere--dir))
      (with-temp-buffer
        (call-process "osascript" nil t nil "app-name")
        (string-trim (buffer-string)))))

  (defun capture-everywhere ()
    "Create a new frame and run `org-capture'."
    (interactive)
    (require 'noflet)
    (make-frame `((name . "capture")
                  (top . 300)
                  (left . 700)
                  (width . 80)
                  (height . 25)
                  (emacs-everywhere-prior-app . ,(get-app-name))))

    (select-frame-by-name "capture")
    (delete-other-windows)
    (noflet ((switch-to-buffer-other-window (buf) (switch-to-buffer buf)))
            (org-capture)))


  (defadvice org-capture-finalize
      (after delete-capture-frame activate)
    "Advise capture-finalize to close the frame and return to the app we came from"
    (when emacs-everywhere-window-focus-command
      (apply #'call-process (car emacs-everywhere-window-focus-command)
             nil nil nil
             (mapcar (lambda (arg)
                       (replace-regexp-in-string "%w" (frame-parameter nil 'emacs-everywhere-prior-app) arg))
                     (cdr emacs-everywhere-window-focus-command))))
    (delete-frame)))

(use-package! org-agenda
  :commands org-agenda
  :custom
  (org-agenda-files '("~/.local/share/notes/gtd/org-gtd-tasks.org"))
  :config
  (setq org-agenda-prefix-format
        '((agenda . "  %?-12t")
          (todo   . " ")
          ;; should maybe come back to these next two, but haven't had a need for it yet
          (tags   . " %i %-12:c")
          (search . " %i %-12:c")))
  (defmacro η (fnc)
    "Return function that ignores its arguments and invokes FNC."
    `(lambda (&rest _rest)
       (funcall ,fnc)))
  
  (advice-add 'org-deadline       :after (η #'org-save-all-org-buffers))
  (advice-add 'org-schedule       :after (η #'org-save-all-org-buffers))
  (advice-add 'org-store-log-note :after (η #'org-save-all-org-buffers))
  (advice-add 'org-todo           :after (η #'org-save-all-org-buffers))
  (advice-add 'org-refile         :after (η #'org-save-all-org-buffers))
  (run-with-idle-timer 300 t (lambda () (save-window-excursion (org-agenda nil "."))))
