.config/doom/modules/lang/org-patch/config.org
** Change refile targets so I can refile to wherever I want from the agenda (e.g. my reference org files, and the inbox if I just want to reprocess a task completely)
#+begin_src emacs-lisp
(use-package! org-refile
  :after org-agenda
  :config
  (add-to-list 'org-refile-targets `(,(directory-files "~/.local/share/notes/reference" t ".*\\.org$") :maxlevel . 3))
  (add-to-list 'org-refile-targets `(,(directory-files "~/.local/share/notes/gtd" t ".*\\.org$") :maxlevel . 3)))
#+end_src
** Quick actions for rescheduling to today/tomorrow (used pretty commonly when things roll over)
#+name: agenda-reschedule
#+begin_src emacs-lisp :tangle no
(defun org-agenda-reschedule-to-today (&optional arg)
  "Reschedule selected task(s) for today."
  (interactive "P")
  (org-agenda-schedule arg "."))

(defun org-agenda-reschedule-to-tomorrow (&optional arg)
  "Reschedule selected task(s) for tomorrow."
  (interactive "P")
  (org-agenda-schedule arg "+1d"))

(setq org-agenda-bulk-custom-functions '((?. org-agenda-reschedule-to-today)
                                         (?> org-agenda-reschedule-to-tomorrow)))
(map! (:map org-agenda-mode-map "." #'org-agenda-reschedule-to-today)
      (:map evil-org-agenda-mode-map :m "." #'org-agenda-reschedule-to-today)
      (:map org-agenda-mode-map ">" #'org-agenda-reschedule-to-tomorrow)
      (:map evil-org-agenda-mode-map :m ">" #'org-agenda-reschedule-to-tomorrow))
#+end_src
** Quick actions for sending back to "incubate"
#+name: agenda-incubate-and-hatch
#+begin_src emacs-lisp :tangle no
(defun +patch/gen-org-refile-rfloc (file headline)
  "Format a specified file/heading for passing to org-refile and org-agenda-refile.

 FILE is the file to refile into.

 HEADLINE is the headline (inside FILE) to refile into."
  (let ((pos (save-excursion
               (find-file file)
               (org-find-exact-headline-in-buffer headline))))
    (list headline file nil pos)))

(defun +patch/org-agenda-refile (file headline)
  "Refile item at point to a particular place via org-agenda-refile, but
 with a simpler interface.

 FILE is the file to refile into.

 HEADLINE is the headline (inside FILE) to refile into."
  (save-window-excursion
    (org-agenda-refile nil (+patch/gen-org-refile-rfloc file headline))))

;; FIXME setting here instead of in :custom becuase it's not working in :custom (see note above)
(setq +patch/org-gtd-tasks-file (concat (file-name-as-directory org-gtd-directory) "org-gtd-tasks.org"))

(defun org-agenda-incubate (&optional arg)
  "Incubate a specified task (includes refiling to incubate section, and specifiying a date to review the task)"
  (interactive "P")
  (org-agenda-schedule arg)
  (+patch/org-agenda-refile +patch/org-gtd-tasks-file "Incubate"))

(defun org-agenda-hatch (&optional arg)
  "Un-incubate (or 'hatch') a specified task (includes refiling to calendar section, and specifiying the date to complete the task)"
  (interactive "P")
  (org-agenda-schedule arg)
  (+patch/org-agenda-refile +patch/org-gtd-tasks-file "Calendar"))

(setq org-agenda-bulk-custom-functions
      (append org-agenda-bulk-custom-functions '((?i org-agenda-incubate)
                                                 (?h org-agenda-hatch))))
(map! (:map org-agenda-mode-map "i" #'org-agenda-incubate)
      (:map org-agenda-mode-map "h" #'org-agenda-hatch)
      (:map org-agenda-keymap "h" #'org-agenda-hatch)
      (:map evil-org-agenda-mode-map "h" #'org-agenda-hatch)
      (:map evil-org-agenda-mode-map :m "i" #'org-agenda-incubate)
      (:map evil-org-agenda-mode-map :m "h" #'org-agenda-hatch))
#+end_src
** Super Agenda [0/9]
A few notes on this:
- including both "agenda" and "alltodo" lets you have both the agenda (with the time grid) /and/ the todo list
- I keep my active TODOs (i.e. the ones scheduled for today, except for "WAIT") in the agenda, and everything else in the todo list (I just want to declutter my agenda be removing anything I have to wait on, and therefore probably can't accurately predict when I can get it done)
- I use the order to split the view into 3 sections: the timeboxed agenda, the regular todo list, and the degenerate todos (unscheduled or overdue)
Future enhancements
- [ ] review the other org props I'm setting here
- [ ] filter "other tasks" after [[https://github.com/alphapapa/org-super-agenda/pull/149][this PR]] is merged (only include NEXT items for the next week or so)
- [ ] format overdue/unscheduled once [[https://github.com/alphapapa/org-ql/pull/44][org-ql formatting changes]] are merged
- [ ] sort sections once [[https://github.com/alphapapa/org-ql/issues/79][org-ql-block sorting]] is merged
#+begin_src elisp
(use-package! org-super-agenda
  :after (org-ql org-agenda)
  :commands org-super-agenda-mode
  :hook (org-agenda-mode . org-super-agenda-mode)
  :custom
  (org-agenda-include-deadlines t)
  (org-agenda-tags-column 100) ;; from testing this seems to be a good value
  (org-agenda-compact-blocks t)
  (org-agenda-custom-commands
   `(("." "What's happening"
      ((agenda "" ((org-agenda-span 'day)
                   (org-agenda-start-day "+0d")
                   (org-super-agenda-groups
                    '((:name "Today"
                       :time-grid t
                       :and (:scheduled today
                             :not (:tag ("%quick" "%easy"))
                             :not (:todo ("DONE" "CNCL" "WAIT")))
                       :order 0)
                      (:name "Remove anything else"
                       :discard (:anything t))))))
       (org-ql-block '(and (tags "%quick")
                           (ts-a :on today)
                           (not (todo "WAIT"))
                           (not (done))
                           (not (regexp ,org-ql-regexp-scheduled-with-time)))
                     ((org-ql-block-header "\n Quick")))
       (org-ql-block '(and (tags "%easy")
                           (ts-a :on today)
                           (not (todo "WAIT"))
                           (not (done))
                           (not (regexp ,org-ql-regexp-scheduled-with-time)))
                     ((org-ql-block-header "\n Easy")))
       (org-ql-block '(and (ts-a :to -1)
                           (not (todo "WAIT"))
                           (not (done))
                           (level 2))
                     ((org-ql-block-header "\n Overdue")))
       (org-ql-block '(and (not (scheduled))
                           (not (done))
                           (level 2))
                     ((org-ql-block-header "\n Unscheduled")))
       (org-ql-block '(and (todo "WAIT"))
                     ((org-ql-block-header "\n Waiting")))
       (org-ql-block '(and (todo "DONE")
                           (ts-a :on today))
                     ((org-ql-block-header "\n Completed today")))
       (org-ql-block '(and (tags ("%quick" "%easy"))
                           (ts-a :from +1 :to +3))
                     ((org-ql-block-header "\n Could pull in"))))))))
#+end_src
Use evil bindings on agenda headers created by super agenda (using best-looking solution from [[https://github.com/alphapapa/org-super-agenda/issues/50][this issue]])
- [ ] should do a proper evil-ification of this eventually
#+begin_src elisp
(after! evil-org-agenda
  (setq org-super-agenda-header-map (copy-keymap evil-org-agenda-mode-map)))
#+end_src
